
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборСтрок();

КонецПроцедуры

&НаКлиенте
Процедура ЭтапыТестированияПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборСтрок();	
	
КонецПроцедуры  


&НаКлиенте
Процедура УстановитьОтборСтрок()
	
	ТекДанные =  Элементы.ЭтапыТестирования.ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено Тогда
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ЭтапТестирования", ТекДанные.ЭтапТестирования);
		Элементы.НастройкиПрограммныхПродуктов.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
		
	КонецЕсли;	
	
КонецПроцедуры  

&НаКлиенте
Процедура НастройкиПрограммныхПродуктовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекДанные =  Элементы.ЭтапыТестирования.ТекущиеДанные;
	
	Если  ТекДанные = Неопределено Тогда   
		
		Отказ = Истина;
		Сообщить("Необходимо выбрать этап тестирования");  
		
	Иначе
		
		Отказ = Истина;
		НовСтрока = Объект.НастройкиПрограммныхПродуктов.Добавить();
		НовСтрока.ЭтапТестирования = ТекДанные.ЭтапТестирования;
		
	КонецЕсли;
	
КонецПроцедуры
