
&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервере(ДанныеВнешнегоОтчетаОбработки, Организация, КонфигурацияИсточник, КонфигурацияПриемник) 
	
	ТабЗначений = Новый ТаблицаЗначений;    
    
	ПоследняяСтрока = ДанныеВнешнегоОтчетаОбработки.ВысотаТаблицы;
	ПоследняяКолонка = ДанныеВнешнегоОтчетаОбработки.ШиринаТаблицы;

	ОбластьЯчеек = ДанныеВнешнегоОтчетаОбработки.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка); 
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();

	ТабЗначений = ПостроительОтчета.Результат.Выгрузить();
	
	Для Счетчик = 0 По ТабЗначений.Количество() - 1 Цикл
        ТекущаяСтрока = ТабЗначений[Счетчик]; 
		
		  Запрос = Новый Запрос;
		  Запрос.Текст = "ВЫБРАТЬ
		  |	ОписаниеИзменений.Ссылка КАК Ссылка
		  |ИЗ
		  |	Справочник.ОписаниеИзменений КАК ОписаниеИзменений
		  |ГДЕ
		  |	ОписаниеИзменений.Организация = &Организация
		  |	И ОписаниеИзменений.КонфигурацияИсточник = &КонфигурацияИсточник
		  |	И ОписаниеИзменений.КонфигурацияПриемник = &КонфигурацияПриемник
		  |	И ОписаниеИзменений.ГруппаМетаданных = &ГруппаМетаданных
		  |	И ОписаниеИзменений.Метаданные = &Метаданные";
		  
		  Запрос.УстановитьПараметр("Организация", Организация);
		  Запрос.УстановитьПараметр("КонфигурацияИсточник", КонфигурацияИсточник);
		  Запрос.УстановитьПараметр("КонфигурацияПриемник", КонфигурацияПриемник);
		  Запрос.УстановитьПараметр("ГруппаМетаданных", ТекущаяСтрока.Вид);
          Запрос.УстановитьПараметр("Метаданные", ТекущаяСтрока.ИмяОбъекта); 
		  
		  Результат = Запрос.Выполнить();
		  Выборка = Результат.Выбрать();
		  
		  Если Выборка.Следующий() Тогда 
			  
			  СпрОбъект =  Выборка.Ссылка.ПолучитьОбъект();
			  СпрОбъект.Статистика =  "Последняя дата формирования – " + ТекущаяСтрока.ДатаЗапуска +  " Всего сформирован – " + ТекущаяСтрока.КоличествоЗапусков;
			  СпрОбъект.Записать();  
			  Сообщить("Изменен объект " + СпрОбъект.Статистика);
		  Иначе
			  
			Сообщить("Не найден объект " + ТекущаяСтрока.Вид + " " + ТекущаяСтрока.ИмяОбъекта);
		  
		  КонецЕсли;
		  	
	КонецЦикла;
	
КонецПроцедуры 


&НаКлиенте
Процедура Загрузить(Команда)
	Если ЗначениеЗаполнено(Организация) Тогда 
		ЗагрузитьНаСервере(ДанныеВнешнегоОтчетаОбработки, Организация, КонфигурацияИсточник, КонфигурацияПриемник);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстЗапроса = "ВЫБРАТЬ
|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка,
|	ДополнительныеОтчетыИОбработки.Наименование КАК Наименование,
|	ДополнительныеОтчетыИОбработки.Версия КАК Версия,
|	ДополнительныеОтчетыИОбработки.Вид КАК Вид,
|	ДополнительныеОтчетыИОбработки.ИмяОбъекта КАК ИмяОбъекта,
|	ДополнительныеОтчетыИОбработки.ИмяФайла КАК ИмяФайла,
|	ДополнительныеОтчетыИОбработки.Информация КАК Информация
|ИЗ
|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
|ГДЕ
|	НЕ ДополнительныеОтчетыИОбработки.ЭтоГруппа";
	
КонецПроцедуры


