
&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервере(ДанныеВнешнегоОтчетаОбработки, Организация, КонфигурацияИсточник, КонфигурацияПриемник) 
	
	ТабЗначений = Новый ТаблицаЗначений;    
    
	ПоследняяСтрока = ДанныеВнешнегоОтчетаОбработки.ВысотаТаблицы;
	ПоследняяКолонка = ДанныеВнешнегоОтчетаОбработки.ШиринаТаблицы;

	ОбластьЯчеек = ДанныеВнешнегоОтчетаОбработки.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка); 
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();

	ТабЗначений = ПостроительОтчета.Результат.Выгрузить();
	
	Для Счетчик = 0 По ТабЗначений.Количество() - 1 Цикл
        ТекущаяСтрока = ТабЗначений[Счетчик];
 		НовСпр = Справочники.ОписаниеИзменений.СоздатьЭлемент(); 
		НовСпр.ДатаЗагрузки = ТекущаяДатаСеанса();
		НовСпр.Организация =  Организация;
		НовСпр.КонфигурацияИсточник = КонфигурацияИсточник;
		НовСпр.КонфигурацияПриемник = КонфигурацияПриемник;
		НовСпр.Наименование = ТекущаяСтрока.Вид + " " + ТекущаяСтрока.Наименование;
		НовСпр.ТипИзменения = Перечисления.ТипыИзменений.ОбъектПрисутствуетТолькоВОсновнойКонфигурации;
		НовСпр.ГруппаМетаданных = ТекущаяСтрока.Вид;
		НовСпр.Метаданные = ТекущаяСтрока.ИмяОбъекта;
		НовСпр.Описание = ТекущаяСтрока.Наименование + Символы.ПС + ТекущаяСтрока.Версия 
						+ Символы.ПС + ТекущаяСтрока.ИмяФайла + Символы.ПС + ТекущаяСтрока.Информация;
		НовСпр.Записать();
	
	КонецЦикла;
	
КонецПроцедуры 


&НаКлиенте
Процедура Загрузить(Команда)
	Если ЗначениеЗаполнено(Организация) Тогда 
		ЗагрузитьНаСервере(ДанныеВнешнегоОтчетаОбработки, Организация, КонфигурацияИсточник, КонфигурацияПриемник);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстЗапроса = "ВЫБРАТЬ
|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка,
|	ДополнительныеОтчетыИОбработки.Наименование КАК Наименование,
|	ДополнительныеОтчетыИОбработки.Версия КАК Версия,
|	ДополнительныеОтчетыИОбработки.Вид КАК Вид,
|	ДополнительныеОтчетыИОбработки.ИмяОбъекта КАК ИмяОбъекта,
|	ДополнительныеОтчетыИОбработки.ИмяФайла КАК ИмяФайла,
|	ДополнительныеОтчетыИОбработки.Информация КАК Информация
|ИЗ
|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
|ГДЕ
|	НЕ ДополнительныеОтчетыИОбработки.ЭтоГруппа";
	
КонецПроцедуры


