
&НаКлиенте
Процедура ДополнительнаяОбработкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ВыполняемаяКоманда = Новый Структура(
		"Ссылка, Представление,
		|Идентификатор, ВариантЗапуска, ПоказыватьОповещение, 
		|Модификатор, ОбъектыНазначения, ЭтоОтчет, Вид" ,Объект.ДополнительнаяОбработка,,,,,,,Ложь );
		ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьОткрытиеФормыОбработки(ВыполняемаяКоманда, ЭтотОбъект, Неопределено);
		
	Иначе
		Сообщить("Сохраните документ");
	КонецЕсли;
	  
КонецПроцедуры
