
&НаСервереБезКонтекста
Процедура ЗаполнитьМетаданныеБезПрефиксаНаСервере()
	Запрос6 = Новый Запрос("ВЫБРАТЬ
	|	ОписаниеИзменений.Ссылка КАК Ссылка,
	|	ОписаниеИзменений.Метаданные КАК Метаданные
	|ИЗ
	|	Справочник.ОписаниеИзменений КАК ОписаниеИзменений
	|ГДЕ
	|	(ВЫРАЗИТЬ(ОписаниеИзменений.МетаданныеБезПрефикса КАК СТРОКА(5))) = """"
	|	И (ПОДСТРОКА(ВЫРАЗИТЬ(ОписаниеИзменений.Метаданные КАК СТРОКА(10)), 3, 1) = ""_""
	|			ИЛИ ПОДСТРОКА(ВЫРАЗИТЬ(ОписаниеИзменений.Метаданные КАК СТРОКА(10)), 4, 1) = ""_"")");
	
	Запрос6.УстановитьПараметр("Символ", "_");
	
	РезультатЗапроса = Запрос6.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Объект_ = Выборка.Ссылка.ПолучитьОбъект();
		ПервыйСимвол =  СтрНайти(Объект_.Метаданные,"_",,,);
		
		Если НЕ ПервыйСимвол = 0 Тогда
			
			СтрокаБезПрефикса = Прав(Объект_.Метаданные, СтрДлина(Объект_.Метаданные) - ПервыйСимвол);
			Объект_.МетаданныеБезПрефикса = СтрокаБезПрефикса;
			Объект_.ЗАписать();
			
		КонецЕсли; 
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМетаданныеБезПрефикса(Команда)
	ЗаполнитьМетаданныеБезПрефиксаНаСервере();
КонецПроцедуры
