
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ОбновитьНаСервере(); 	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОписаниеИзмененийСвязанныеОбъекты.Ссылка КАК СвязанныйОбъект
	               |ИЗ
	               |	Справочник.ОписаниеИзменений.СвязанныеОбъекты КАК ОписаниеИзмененийСвязанныеОбъекты
	               |ГДЕ
	               |	ОписаниеИзмененийСвязанныеОбъекты.СвязанныйОбъект = &СвязанныйОбъект";
	
	Запрос.УстановитьПараметр("СвязанныйОбъект", Объект.Ссылка );
	
	СвязанныеОбъекты.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры
